IDEA Open Model
ProjectDataEc Class
Compatible with IDEA StatiCa Beta 20.0
 Additional data for Ec project
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.ProjectDataEc
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ProjectDataEc : OpenObject
Public Class ProjectDataEc
	Inherits OpenObject
The ProjectDataEc type exposes the following members.
Constructors
Name | Description
ProjectDataEc
Initializes a new instance of the ProjectDataEc class
Top
Properties
Name | Description
AnnexCode
 Gets or sets the actual national annex
FatigueAnnexNN
 True for check fatigue accorting 1992-2 Annex NN
FatigueCheck
 To allow fatigue check
Top
See Also
Reference
IdeaRS.OpenModel Namespace